import Animals from '../../../shared/assets/photo/TasksPhoto/Animals.jpg'
import BeautyandHelth from '../../../shared/assets/photo/TasksPhoto/BeautyandHelth.jpg'
import Build from '../../../shared/assets/photo/TasksPhoto/Build.jpg'
import CargoTeansportation from '../../../shared/assets/photo/TasksPhoto/CargoTeansportation.jpg'
import cloth from '../../../shared/assets/photo/TasksPhoto/cloth.jpg'
import ComputerHelp from '../../../shared/assets/photo/TasksPhoto/ComputerHelp.jpg'
import Courier from '../../../shared/assets/photo/TasksPhoto/Courier.jpg'
import DigitalEquipmentRepair from '../../../shared/assets/photo/TasksPhoto/DigitalEquipmentRepair.jpg'
import HelpAndCeaning from '../../../shared/assets/photo/TasksPhoto/HelpAndCeaning.jpg'
import InstallationAndRepair from '../../../shared/assets/photo/TasksPhoto/InstallationAndRepair.jpg'
import Party from '../../../shared/assets/photo/TasksPhoto/Party.jpg'
import PhotoVideoAudio from '../../../shared/assets/photo/TasksPhoto/PhotoVideoAudio.jpg'
import Programming from '../../../shared/assets/photo/TasksPhoto/Programming.jpg'
import realEstate from '../../../shared/assets/photo/TasksPhoto/realEstate.jpg'
import Rep from '../../../shared/assets/photo/TasksPhoto/Rep.jpg'
import Sport from '../../../shared/assets/photo/TasksPhoto/Sport.jpg'
import TransporRepair from '../../../shared/assets/photo/TasksPhoto/TransporRepair.jpg'
import VirtualHelp from '../../../shared/assets/photo/TasksPhoto/VirtualHelp.jpg'

const serviceDetails = {
  "Курьерские услуги": {
      image: Courier,
      links: [
        { name: "Услуги пешшего курьера" },
        { name: "Услуги курьера на легковом авто" },
        { name: "Купить и доставить" },
        { name: "Срочная доставка" },
        { name: "Доставка продуктов" },
        { name: "Доставка еды и ресторанов" },
        { name: "Курьер на день" },
        { name: "Что-то другое" },
      ],
    },

    "Ремонт и строительство": {
      image: Build,
      links: [
        { name: "Сантехнические работы" },
        { name: "Электромонтажные работы" },
        { name: "Установка и ремонт дверей, замков" },
        { name: "Кровельные и фасадные работы" },
        { name: "Крупное строительство" },
        { name: "Сборка и ремонт мебели" },
        { name: "Отделочные работы" },
        { name: "Плиточные работы" },
        { name: "Полы" },
        { name: "Охранные системы" },
        { name: "Отопление, водоснабжение, конализация" },
        { name: "Потолки" },
        { name: "Окна, стекление, балконы" },
        { name: "Изоляционные работы" },
        { name: "Вскрытие замков" },
        { name: "Что-то другое" },
      ],
    },

    "Разработка ПО": {
      image: Programming,
      links: [
        { name: "Сайт под ключ" },
        { name: "Разработка мобильных приложений" },
        { name: "Программирование" },
        { name: "Доработка и поддержка сайта" },
        { name: "Доработка и настройка 1C" },
        { name: "Создание лендингов" },
        { name: "Сайт под ключ" },
        { name: "Скрипты и боты" },
        { name: "Что-то другое" },

      ],
    },

    "Уборка и помощь по дому": {
      image: HelpAndCeaning,
      links: [
        { name: "Поддерживающая уборка" },
        { name: "Генеральная уборка" },
        { name: "Мытье окон" },
        { name: "ВВынос мусора" },
        { name: "Помощь швеи" },
        { name: "Приготовление еды" },
        { name: "Глажение белья" },
        { name: "Химчистка" },
        { name: "Уход за животными" },
        { name: "Сиделки" },
        { name: "Няни" },
        { name: "Санитарные работы" },
        { name: "Работы в саду, участке" },
        { name: "Что-то другое" },
      ],
    },

    "Компьютерная помощь": {
      image: ComputerHelp,
      links: [
        { name: "Ремонт компьютерная помощь" },
        { name: "Настройка интернета и WI-FI" },
        { name: "Настройка и ремонт оргтехники" },
        { name: "Установка и настройка операцю систем, программ" },
        { name: "Восттановление данных" },
        { name: "Консультация и обучение" },
        { name: "Удаление вирусов" },
        { name: "Ремонт и замена комплектующих" },
        { name: "Что-то другое" },
      ],
    },

    "Ремонт транспорта": {
      image: TransporRepair,
      links: [
        { name: "Техническое обслуживание авто" },
        { name: "Кузовной ремонт" },
        { name: "Шиномонтаж" },
        { name: "Диагностика и ремонт двгателя, КПП " },
        { name: "Автоэлектрика" },
        { name: "Мойка и химчистка" },
        { name: "Обслуживание системы кондиционировани" },
        { name: "Автостекла и тонировка" },
        { name: "Тюнинг (внешний и внутренний)" },
        { name: "Что-то другое" },
      ],
    },

    "Фото, видео, аудио": {
      image: PhotoVideoAudio,
      links: [
        { name: "Фотосъемка" },
        { name: "Обработка фотографий" },
        { name: "Монтаж и цветокоррекция" },
        { name: "Видеосъемка" },
        { name: "Создание видео под ключ" },
        { name: "Оцифровка" },
        { name: "Запись аудио" },
        { name: "Модели для съемок" },
        { name: "Что-то другое" },
      ],
    },

    "Репетиторы и обучение": {
      image: Rep,
      links: [
        { name: "Русский язык и литература" },
        { name: "Немецкий язык" },
        { name: "Математика и физика" },
        { name: "География и экономика" },
        { name: "Музыка, танцы, арт" },
        { name: "Спорт" },
        { name: "Английский язык" },
        { name: "Испанский язык" },
        { name: "Биология и химия" },
        { name: "Информатика и программировнаие" },
        { name: "Помощь студентам" },
        { name: "Автоинструкторы" },
        { name: "Французский язык" },
        { name: "Другие иностранные языки" },
        { name: "История и обществознание" },
        { name: "Подготовка к школе" },
        { name: "Логопеды" },
        { name: "Помощь младшие классы" },
        { name: "Что-то другое" },
      ],
    },

    "Дизайн": {
      image: cloth,
      links: [
        { name: "Фирменный стиль, логотипы, визитки" },
        { name: "Дизайн сайтов и приложений" },
        { name: "Инографика, презентация, иконки" },
        { name: "Дизайн одежды" },
        { name: "Полиграфический дизайн" },
        { name: "Интернет-баннеры, оформление соц. сетей" },
        { name: "Наружная реклама, стенды" },
        { name: "Иллюстрации, живопись, граффити" },
        { name: "3-d - графика, анимация" },
        { name: "Архитектура, интервью, ландшафт" },
        { name: "Чтото другое" },
      ],
    },

    "Установка и ремонт техники": {
      image: InstallationAndRepair,
      links: [
        { name: "Холодильники и морозильные камеры" },
        { name: "Электрические плиты и пнели" },
        { name: "Вытяжки" },
        { name: "Швейные машины" },
        { name: "Кофемашины" },
        { name: "Уход за телом и здоровьем" },
        { name: "Стиральные и сушильные машины" },
        { name: "Газовые плиты" },
        { name: "Климатическая техника" },
        { name: "Пылесосы и очистители" },
        { name: "СВЧ печи" },
        { name: "Строительная и садовая техника" },
        { name: "Посудомоечные машины" },
        { name: "Духовые шкафы" },
        { name: "Водонагреватели, бойлеры, котлы, колонки" },
        { name: "Утюги и уход за одеждой" },
        { name: "Мелкая кухонная техника" },
        { name: "Что-то другое" },
      ],
    },
    
    "Виртуальный помощник": {
      image: VirtualHelp,
      links: [
        { name: "Работа с текстом" },
        { name: "Работа с числовыми данными" },
        { name: "Размещение на рекламных площадок" },
        { name: "Обзвон по базе" },
        { name: "Услуги переводчика" },
        { name: "Подготовка презентаций" },
        { name: "Помощь SMM-специалиста" },
        { name: "Услуги личного помощника" },
        { name: "Поиск и обработка информации" },
        { name: "Расшифровка аудио- и видеозаписей" },
        { name: "Реклама и продвижение" },
        { name: "Что-то другое" },
      ],
    },

    "Мероприятия": {
      image: Party,
      links: [
        { name: "Помощь в проведении мероприятий" },
        { name: "Разнорабочий" },
        { name: "Промо-модель" },
        { name: "Раздача промо-материалов" },
        { name: "Промоутер" },
        { name: "Мерчандайзеры" },
        { name: "Тайный покупатель" },
        { name: "Тамада, ведущий, аниматор" },
        { name: "Комплектовщики" },
        { name: "Что-то другое" },
      ],
    },

    "Красота и здоровье": {
      image: BeautyandHelth,
      links: [
        { name: "Тату и пирсинг" },
        { name: "Стилисты и имиджмейкеры" },
        { name: "Услуги медсестры" },
        { name: "Парикмахерские услуги" },
        { name: "Массаж" },
        { name: "Персональный тренер" },
        { name: "Ногтевой сервис" },
        { name: "Психологи" },
        { name: "Спорт" },
        { name: "Что-то другое" },
      ],
    },

    "Ремонт цифровой техники": {
      image: DigitalEquipmentRepair,
      links: [
        { name: "Планшеты и телефоны" },
        { name: "Автомобильная электроника" },
        { name: "Игровые приставки" },
        { name: "Аудиотехника и системы" },
        { name: "Видео/фототекника" },
        { name: "Спутниковые и эфирные антены" },
        { name: "Телевизоры и мониторы" },
        { name: "Часы и хронометры" },
        { name: "Что-то другое" },
      ],
    },

    "Грузоперевозки": {
      image: CargoTeansportation,
      links: [
        { name: "Перевозка вещей, переезды" },
        { name: "Вывоз мусора" },
        { name: "Услуги грузчиков" },
        { name: "Другой груз" },
        { name: "Пассажирские перевозки" },
        { name: "Эвакуаторы" },
        { name: "Перевозка продуктов" },
        { name: "Строительные грузы и оборудование" },
        { name: "Междугородные перевозки" },
        { name: "Услуги манипулятора" },
        { name: "Что-то другое" },
      ],
    },

    "Животные": {
      image: Animals,
      links: [
        { name: "Груминг" },
        { name: "Выгул" },
        { name: "Перевозка" },
        { name: "Передержка питомцев" },
        { name: "Услуги ухода на дому" },
        { name: "Обучение и дрессировка" },
        { name: "Ветеринарные услуги" },
        { name: "Услуги по уходу за аквариумами" },
        { name: "Услуги по уходу за грызунами и птицами" },
        { name: "Фотосессии для домашних животных" },
        { name: "Тематические прогулки и встречи с другими питомцами" },
        { name: "Что-то другое" },
      ],
    },

    "Спорт": {
      image: Sport,
      links: [
        { name: "Личный тренер по фитнесу" },
        { name: "Инструктор по плаванию" },
        { name: "Персональный тренер по боксу" },
        { name: "Йога и пилатес" },
        { name: "Занятия по кроссфиту" },
        { name: "Танцы" },
        { name: "Спортивные секции для детей" },
        { name: "Персонализированные планы питания" },
        { name: "Услуги по составлению диет для набора или похудения массы" },
        { name: "Велосипедные тренировки" },
        { name: "Программы восстановления после травм" },
        { name: "Организация спортивных турниров и соревнований" },
        { name: "Соревнования по настольным играм" },
        { name: "Обучение верховой езде" },
        { name: "Волейбол" },
        { name: "Футбол" },
        { name: "Настольный теннис" },
        { name: "Хоккей/фигурное катание" },
        { name: "Что-то другое" },
      ],
    },

    "Недвижимость": {
      image: realEstate,
      links: [
        { name: "Услуги риелтора" },
        { name: "Юрист по недвижимости" },
        { name: "Консультация по инвестиции" },
        { name: "Анализ рынка" },
        { name: "Подбор объектов для инвестирования" },
        { name: "Оценка рыночной стоимости" },
        { name: "Экспертиза состояния объектов" },
        { name: "Подготовка к продаже" },
        { name: "Фотосессии и видеопрезентации " },
        { name: "Онлайн-консультации" },
        { name: "Услуги аренды" },
        { name: "Организация переезда" },
        { name: "Обслуживание и управление" },
        { name: "Услуги хранения вещей" },
        { name: "Семинары по покупке и продаже" },
        { name: "Консультации по земельным вопросам" },
        { name: "Ремонт и отделка" },
        { name: "Консультации по налоговым вопросам" },
        { name: "Финансовое планирование" },
        { name: "Что-то другое" },
      ],
    },

    "Юридические и бухгалтерские услуги": {
      image: realEstate,
      links: [
        { name: "Консультация специалиста по налогам" },
        { name: "Оформление документов" },
        { name: "Составление и подача жалоб, исков" },
        { name: "Делопроизводство и работа с кадрами" },
        { name: "Бухгалтерские услуги" },
        { name: "Услуги адвоката" },
        { name: "Составление и проверка договоров" },
        { name: "Тендеры" },
        { name: "Нотариальные услуги" },
        { name: "Регистрация, ликвидация компаний" },
        { name: "Юридическое сопровождение" },
        { name: "Юрист по недвижимости" },
        { name: "Что-то другое" },
      ],
    },
  };
  
  export default serviceDetails;